mahdi-benhassen/AgriNetPro_gw_node/gateway/rcp/sdkconfig.defaults
# Target: ESP32-H2 (802.15.4 RCP)
CONFIG_IDF_TARGET="esp32h2"

# Zigbee RCP mode
CONFIG_ZB_ENABLED=y
CONFIG_ZB_RCP=y

# UART for RCP (Connect to S3 Host)
CONFIG_ZB_RCP_UART_TX_PIN=17
CONFIG_ZB_RCP_UART_RX_PIN=18
CONFIG_ZB_RCP_UART_PORT=1
CONFIG_ZB_RCP_UART_BAUDRATE=460800

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
